USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

/*================================================================================================================
■ USP_NAME					: SP_MOV2_HISTORY_DELETE
■ DESCRIPTION				: 삭제_히스토리정보
■ INPUT PARAMETER			: CUS_NO
■ EXEC						: 
    -- exec SP_MOV2_HISTORY_DELETE 8712212 

■ MEMO						: 히스토리 정보를 삭제한다.
------------------------------------------------------------------------------------------------------------------
■ CHANGE HISTORY                   
------------------------------------------------------------------------------------------------------------------
   DATE				AUTHOR			        DESCRIPTION           
------------------------------------------------------------------------------------------------------------------
   2017-07-27		오준욱(IBSOLUTION)		최초생성
================================================================================================================*/ 
CREATE PROCEDURE [dbo].[SP_MOV2_HISTORY_DELETE]
	@CUS_NO			INT
AS
BEGIN

	DELETE FROM CUS_MASTER_HISTORY 
	WHERE CUS_NO = @CUS_NO

END           



GO
