USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO


/*================================================================================================================
■ USP_NAME					: XP_ACR_DELETE
■ DESCRIPTION				: 경위서 삭제
■ INPUT PARAMETER			: 
	@ACR_SEQ_NO INT			: 경위서 순번
■ OUTPUT PARAMETER			: 
■ EXEC						: 
	
	EXEC DBO.XP_ACR_DELETE 2

■ MEMO						: 
------------------------------------------------------------------------------------------------------------------
■ CHANGE HISTORY                   
------------------------------------------------------------------------------------------------------------------
   DATE				AUTHOR			DESCRIPTION           
------------------------------------------------------------------------------------------------------------------
   2013-06-19		김완기			최초생성
================================================================================================================*/ 
CREATE PROC [dbo].[XP_ACR_DELETE]
	@ACR_SEQ_NO INT 
AS 
BEGIN

	DELETE ACR_MASTER
	WHERE ACR_SEQ_NO =  @ACR_SEQ_NO

END 

GO
