USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

/*==================================================================================
	기본내용
====================================================================================
- SP 명 : XP_NAVER_PKG_DETAIL_UPDATE_HISTORY_TARGET_SELECT
- 기 능 : 네이버 상품 변경내역 , (스케쥴러에서 처리할 데이터  )

XP_NAVER_PKG_DETAIL_UPDATE_HISTORY_TARGET_SELECT

====================================================================================
	참고내용
====================================================================================
- 네이버 상품 연동 수정행사 조회 
====================================================================================
	변경내역
====================================================================================
- 2019-12-18 박형만 최초생성
===================================================================================*/
create PROC [dbo].[XP_NAVER_PKG_DETAIL_UPDATE_HISTORY_TARGET_SELECT]
	@LAST_SEQ_NO INT = 0   -- 최종 처리 SEQ_NO  기본값0
AS 
BEGIN
	SELECT * FROM  NAVER_PKG_DETAIL_UPDATE_HISTORY WITH(NOLOCK)
	WHERE SEQ_NO > @LAST_SEQ_NO  -- 최종처리 다음꺼 부터 
	AND CHK_DATE IS NULL 
	ORDER BY SEq_NO ASC 
END 
GO
