USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

/*================================================================================================================
■ USP_NAME					: SP_PKG_SENDING_DELETE
■ DESCRIPTION				: 샌딩 입력
■ INPUT PARAMETER			: 
■ OUTPUT PARAMETER			: 
■ EXEC						: 
■ MEMO						: 
------------------------------------------------------------------------------------------------------------------
■ CHANGE HISTORY                   
------------------------------------------------------------------------------------------------------------------
   DATE				AUTHOR			DESCRIPTION           
------------------------------------------------------------------------------------------------------------------  
    2017-05-17		정지용			최초생성
================================================================================================================*/ 
CREATE PROC [dbo].[SP_PKG_SENDING_DELETE]
	@SEQ_NO INT
AS 
BEGIN
	SET NOCOUNT OFF;

	DELETE FROM PKG_SENDING WHERE SEQ_NO = @SEQ_NO
END
	
GO
