USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

/*================================================================================================================
■ USP_NAME					: SP_MOV2_VIEW_MASTER_DELETE
■ DESCRIPTION				: 삭제_조회중인마스터_행사상품
■ INPUT PARAMETER			: VIEW_SEQ
■ EXEC						: 
    -- SP_MOV2_VIEW_MASTER_DELETE 12145	

■ MEMO						: 조회중인마스터/행사상품 입력
------------------------------------------------------------------------------------------------------------------
■ CHANGE HISTORY                   
------------------------------------------------------------------------------------------------------------------
   DATE				AUTHOR			        DESCRIPTION           
------------------------------------------------------------------------------------------------------------------
   2017-08-02		오준욱(IBSOLUTION)		최초생성
================================================================================================================*/ 
CREATE PROCEDURE [dbo].[SP_MOV2_VIEW_MASTER_DELETE]
	@VIEW_SEQ		int
AS
BEGIN
		DELETE FROM VIEW_MASTER WHERE VIEW_SEQ = @VIEW_SEQ
END           



GO
