USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
/*================================================================================================================
■ USP_NAME					: XP_COM_BTMS_CARDINFO_DELETE
■ DESCRIPTION				: BTMS 거래처 카드정보 삭제
■ INPUT PARAMETER			: 
	@AGT_CODE				: 거래처코드
■ OUTPUT PARAMETER			: 
■ EXEC						: 
■ MEMO						: 
------------------------------------------------------------------------------------------------------------------
■ CHANGE HISTORY
------------------------------------------------------------------------------------------------------------------
   DATE					AUTHOR				DESCRIPTION           
------------------------------------------------------------------------------------------------------------------
   2016-04-28		저스트고강태영			최초 생성
================================================================================================================*/ 
CREATE PROC [dbo].[XP_COM_BTMS_CARDINFO_DELETE]
	@AGT_CODE		VARCHAR(10)
AS 
BEGIN

DELETE AGT_ACCOUNT
WHERE AGT_CODE = @AGT_CODE

END
GO
