USE [Diablo]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
/*==================================================================================
	기본내용
====================================================================================
- SP 명 : SP_AIR_FARE_DISCOUNT_DELETE
- 기 능 : 오늘의 특가 항공권 삭제  ( USE_YN = 'N' 으로 ) 
====================================================================================
	참고내용
====================================================================================
- 예제
 EXEC SP_AIR_FARE_DISCOUNT_DELETE 1 , '9999999'
====================================================================================
	변경내역
====================================================================================
- 2011-04-05 박형만 신규 작성 
- 2012-10-09 박형만 오늘의 특가 항공권으로 변경 
===================================================================================*/
CREATE PROC [dbo].[SP_AIR_FARE_DISCOUNT_DELETE]
	@SEQ_NO INT , 
	@NEW_CODE	NEW_CODE	--	등록자
AS

UPDATE FARE_DISCOUNT 
SET USE_YN = 'N'
	,EDT_CODE = @NEW_CODE 
	,EDT_DATE = GETDATE()
WHERE SEQ_NO = @SEQ_NO 
GO
